export default {
  // Global page headers: https://go.nuxtjs.dev/config-head
  head: {
    title: 'nuts',
    meta: [
      { charset: 'utf-8' },
      { name: 'viewport', content: 'width=device-width, initial-scale=1' },
      { hid: 'description', name: 'description', content: '' },
      { name: 'format-detection', content: 'telephone=no' },
    ],
    link: [
      { rel: 'icon', type: 'image/x-icon', href: '/favicon.ico' },
      { rel: 'shortcut icon', type: 'image/png', href: '/images/logo.png' },
      { rel: 'preconnect', href: 'https://fonts.googleapis.com' },
      {
        rel: 'preconnect',
        href: 'https://fonts.gstatic.com',
        crossOrigin: true,
      },
      {
        rel: 'stylesheet',
        href: 'https://fonts.googleapis.com/css2?family=Montserrat:wght@500;800&family=Raleway:ital,wght@0,500;0,800;1,500&display=swap',
      },
    ],
  },

  // Global CSS: https://go.nuxtjs.dev/config-css
  css: [
    '~node_modules/swiper/swiper-bundle.css',
    '~node_modules/vuesax/dist/vuesax.css',
    '~node_modules/material-icons/iconfont/material-icons.css',
    '~assets/style/global',
  ],

  // Plugins to run before rendering page: https://go.nuxtjs.dev/config-plugins
  plugins: [
    { src: '~plugins/toast', mode: 'client' },
    { src: '~plugins/select' },
    { src: '~/plugins/swiper', mode: 'client', ssr: false },
    { src: '~plugins/vee-validate', mode: 'client' },
    { src: '~plugins/uploadImg' },
    { src: '~plugins/db' },
    { src: '~plugins/vuesax', mode: 'client' },
  ],

  // Auto import components: https://go.nuxtjs.dev/config-components
  components: true,

  // Modules for dev and build (recommended): https://go.nuxtjs.dev/config-modules
  buildModules: [
    // https://go.nuxtjs.dev/eslint
    '@nuxtjs/eslint-module',
  ],

  // router: {
  //   middleware: ['auth']
  // },

  // Modules: https://go.nuxtjs.dev/config-modules
  modules: [
    // https://go.nuxtjs.dev/axios
    '@nuxtjs/axios',
    // https://go.nuxtjs.dev/pwa
    '@nuxtjs/pwa',
    '@nuxtjs/firebase',
    '@nuxtjs/i18n',
  ],

  // Axios module configuration: https://go.nuxtjs.dev/config-axios
  axios: {},

  // PWA module configuration: https://go.nuxtjs.dev/pwa
  pwa: {
    manifest: {
      lang: 'en',
    },
  },

  firebase: {
    config: {
      apiKey: 'AIzaSyD3jYW9w1vZdAw4efW1SzamcRZrsVuUxfc',
      authDomain: 'nuts-ea11b.firebaseapp.com',
      databaseURL: 'https://nuts-ea11b-default-rtdb.firebaseio.com',
      projectId: 'nuts-ea11b',
      storageBucket: 'nuts-ea11b.appspot.com',
      messagingSenderId: '1039641335607',
      appId: '1:1039641335607:web:95c8ebd7b8a5c6e803ecb2',
    },
    initialize: {
      onAuthStateActions: 'onAuthStateChangedAction',
      subcribeManually: false,
    },
    ssr: true,
    services: {
      auth: true, // Just as example. Can be any other service.
      database: true,
      storage: true,
    },
  },

  i18n: {
    locales: ['ru', 'ua'],
    defaultLocale: 'ru',
    vueI18n: {
      fallbackLocale: 'ru',
      messages: {
        ru: {
          header: {
            sale: 'Ваша персональная скидка',
            admin: 'Админ',
            login: 'Войти',
            register: 'Регистрация',
            logout: 'Выйти',
            callback: 'Заказать звонок',
            callbackTime: 'Ждем Вашего звонка ежедневно с 9 до 18',
            callbackOrder: 'Введите ваш номер телефона',
            callbackConfirm: 'Подтвердить',
            basket: {
              empty: 'Ничего не добавлено',
              catalog: 'Перейти в каталог',
              basket: 'Перейти в корзину',
              total: 'Всего',
            },
            menu: {
              shop: 'Магазин',
              about: 'О производстве',
              delivery: 'Оплата и доставка',
              corporate: 'Оптовым и корпоративным клиентам',
              news: 'Новости и статьи',
              gallery: 'Галерея',
            },
          },
          home: {
            position: 'Главная',
            products: {
              title: 'Продукция',
              text: 'Экологически чистые, качественные ядра грецкого ореха и фундука, а также плоды шиповника в удобной, надежной, вакуумной упаковке разного объема',
              btn: 'Перейти в магазин',
            },
            benefits: {
              title: 'О пользе продукта',
              text: 'Каждый вид ореха содержит свой неповторимый уникальный баланс витаминов, и микроэлементов',
              walnut: {
                title: 'Грецкий орех',
                text: 'Дерево жизни - так часто величают грецкий орех, поскольку с давних пор он кормил, восстанавливал силы и лечил человека. Даже небольшая горсть грецких орехов - это кладезь витаминов и хорошая профилактика многих заболеваний.',
              },
              hazelnut: {
                title: 'Фундук',
                text: 'Витамин А улучшает зрение и повышает иммунитет. Комплекс витаминов группы В нормализует работу ЦНС, улучшает состав крови, укрепляет иммунную и кровеносную системы, систему обмена веществ.',
              },
              rose: {
                title: 'Шиповник',
                text: 'В народной медицине отвары из шиповника применялись при скарлатине, тифе, туберкулезе, воспалении почек, болезнях кишечника, печени, желудка.',
              },
            },
          },
          shop: {
            title: 'Каталог продукции',
            filter: {
              title: 'Фильтр',
              type: 'Тип',
              weight: 'Масса',
              price: 'Стоимость',
              submit: 'Применить',
              reset: 'Сбросить',
            },
            showAll: 'Посмотреть ещё',
            hideAll: 'Скрыть',
            about: {
              title: 'Экологически чистый грецкий орех',
              subtitle: 'Оптом и в розницу',
              text: 'Сельскохозяйственный обслуживающий кооператив “Орех Причерноморья” выращивает смешанные сады ореха грецкого с фундуком, а также ореха грецкого с шиповником, на площади более 150 гектаров. Помимо этого кооператив занимается выращиванием посадочного материала, саженцов привитого и непривитого грецкого ореха, фундука и шиповника. Орех Причерноморья – это первый и единственный в Украине сад по совместному выращиванию фундука и грецкого ореха Сельскохозяйственный обслуживающий кооператив “Орех Причерноморья” выращивает смешанные сады ореха грецкого с фундуком, а также ореха грецкого с шиповником, на площади более 150 гектаров. Помимо этого кооператив занимается выращиванием посадочного материала, саженцов привитого и непривитого грецкого ореха, фундука и шиповника. Орех Причерноморья – это первый и единственный в Украине сад по совместному выращиванию фундука и грецкого ореха',
            },
          },
          shopItem: {
            composition: 'Состав:',
            weight: 'Масса нетто:',
            calories: 'Энергетическая ценность:',
            experation: 'Срок годности:',
            price: 'Ваша цена:',
            order: 'Заказать',
            about: {
              description: {
                title: 'Описание',
                walnut: {
                  text: `Уже 4000 лет люди питаются ценными грецкими орехами. Они особенно полезны послеоперационным больным, детям, кормящим, беременным женщинам. Чтобы вернуть силы, укрепить иммунитет, одолеть туберкулез, кашель; грецкий орех очищенный, отборный нужно истолочь, смешать с медом (2:1) и чайную ложку целебной смеси употреблять перед едой. В белке грецких орехов много (15 %) аргинина. Он особенно нужен детям, больным, пожилым людям, в организме которых аминокислота плохо синтезируется. Аргинин помогает сосудам регенерировать, а всему организму – победить воспаления.`,
                  list1: {
                    title: 'Другие полезные вещества грецких орехов:',
                    item1: 'Антиоксиданты защищают печень от повреждений',
                    item2: 'Полифенолы не дают образоваться сосудистым тромбам',
                    item3:
                      'Нейропротекторы улучшают работу мозга, отодвигают старость',
                  },
                  list2: {
                    title: 'Нужно систематически есть грецкие орехи, чтобы:',
                    item1: 'На 30–40 % снизить риск заболевания раком простаты',
                    item2: 'На 50 % – раком молочной железы',
                    item3:
                      'Предотвратить дегенерацию глазной макулы, а значит, улучшить зрение',
                    item4:
                      'Отрегулировать обмен веществ, выработку инсулина; понизить количество сахара в крови',
                  },
                },
                hazelnut: {
                  text: 'Фундук очень полезен',
                },
                rose: {
                  text: 'Шиповник очень полезен',
                },
              },
              package: {
                title: 'Упаковка',
                text: 'Хорошо упакуем',
              },
              payment: {
                title: 'Оплата',
                text: 'Оплачивайте любым удобным способом',
              },
              delivery: {
                title: 'Доставка',
                text: 'Быстро доставим',
              },
            },
          },
          product: {
            weight: 'Масса',
            package: 'Вакуумная',
            price: 'Цена:',
            buy: 'Купить',
          },
          about: {
            position: 'О производстве',
            title: 'О производителе',
            text: 'Сельскохозяйственный обслуживающий кооператив “Орех Причерноморья” выращивает смешанные сады ореха грецкого с фундуком, а также ореха грецкого с шиповником, на площади более 150 гектаров. Помимо этого кооператив занимается выращиванием посадочного материала, саженцов привитого и непривитого грецкого ореха, фундука и шиповника.',
            description: 'Подробнее',
            writeUs: {
              title: 'Введите ваше сообщение',
              name: 'Ваше имя*',
              email: 'Ваш email*',
              message: 'Ваше сообщенеи*',
              submit: 'Подтвердить',
            },
            chief: {
              name: 'Павел Тулба',
              pos: 'Учередитель и владелец предприятия "Орех Причерноморья"',
              quote:
                'Главная наша цель - получить максимальную прибыль с одного гектара',
              writeUs: 'Написать нам',
            },
            history: {
              title: 'История предприятия',
              text1:
                'Наше предприятие основано в 2012 году для закладки смешанного сада грецкого ореха и фундука.',
              text2:
                'На сегодня мы уже заложили более 100 гектаров сада и продолжаем расширять свои насаждения. Кроме выращивания грецкого ореха и фундука, мы занимаемся выращиванием саженцев, разведением и выращиванием овец, а также являемся первой в Украине компанией, приступившей к промышленному выращиванию трюфелей на корнях фундука.',
              text3:
                'Земля, которой пользуется кооператив, является собственностью членов нашего кооператива.',
            },
            gallery: {
              title: 'Галерея',
              text: 'Кадры социальной активности компании',
              showAll: 'Смотреть всю галерею',
            },
          },
          area: {
            item1: 'Смешаных садов',
            item2: 'Тепличного комплекса',
            item3: 'Первая промышленная плантация шиповника в Украине',
            item4: 'Приживаемости саженцев',
          },
          delivery: {
            title: 'Оплата и доставка',
            payment: {
              title: 'Оплата заказа',
              subtitle: 'Способы оплаты',
              item1: {
                title: 'Безналичный расчет',
                text: 'Вы можете выбрать “получить реквизиты” для дальнейшей оплаты на карту, или в терминалах.',
              },
              item2: {
                title: 'Оплата с помощью банковской карты',
                text: 'Оплатите Ваш заказ картой любого банка онлайн (LiqPay/Приват24)',
              },
              item3: {
                title: 'Наличный расчет',
                text: 'Оплата заказов наложенным платежом в отделении Новой Почты, или наличными курьерами',
              },
            },
            delivery: {
              title: 'Доставка партии',
              subtitle: 'Способы доставки',
              item: {
                title: 'Новая почта',
                text: 'Доставки по всей украине',
              },
            },
            return: {
              title: 'Возврат товара',
              text: 'Возврат товара осуществляется в соответствии с Законом Украины «О защите прав потребителей».',
            },
          },
          corporate: {
            title: 'Оптовым и копроративным клиентам',
            text1:
              'Сельскохозяйственный обслуживающий кооператив “Орех Причерноморья” предлагает своим клиентам выгодные условия сотрудничества. Особые условия подготовлены для розничных магазинов, компаний HoReCa, спорт - клубов.',
            text2:
              'Мы готовы рассмотреть особые условия для оптовых покупателей, с готовностью идем на встречу любому предложению. Если вы заинтересованы в нашей продукции, пишите, или звоните в наш главный офис - мы всегда пойдем вам на встречу!',
            writeUs: {
              title: 'Введите ваше сообщение',
              name: 'Ваше имя*',
              email: 'Ваш email*',
              message: 'Ваше сообщенеи*',
              submit: 'Подтвердить',
              btn: 'Написать нам',
            },
            supermarket: {
              title: 'Крупные супермакеты',
              text: 'СОК "Орех Причерноморья" предлагает своим клиентам выгодные условия сорудничества. Мы готовы рассмотреть особые условия для оптовых покупателей, с готовностью идем на встречу к любому предложению. Особые условия подготовленны для розничных магазинов. компаний HoReCa, спорт-клубов. Если вы заинтересованы в нашей продукции, пишите или звоните в наш главный офис, мы всегда пойдем вам на встречу.',
            },
            shop: {
              title: 'Розничные магазины',
              text: 'СОК "Орех Причерноморья" предлагает своим клиентам выгодные условия сорудничества. Мы готовы рассмотреть особые условия для оптовых покупателей, с готовностью идем на встречу к любому предложению. Особые условия подготовленны для розничных магазинов. компаний HoReCa, спорт-клубов. Если вы заинтересованы в нашей продукции, пишите или звоните в наш главный офис, мы всегда пойдем вам на встречу.',
            },
            HoReCa: {
              title: 'Компании HoReCa',
              text: 'СОК "Орех Причерноморья" предлагает своим клиентам выгодные условия сорудничества. Мы готовы рассмотреть особые условия для оптовых покупателей, с готовностью идем на встречу к любому предложению. Особые условия подготовленны для розничных магазинов. компаний HoReCa, спорт-клубов. Если вы заинтересованы в нашей продукции, пишите или звоните в наш главный офис, мы всегда пойдем вам на встречу.',
            },
            fitness: {
              title: 'Фитнес клубы',
              text: 'СОК "Орех Причерноморья" предлагает своим клиентам выгодные условия сорудничества. Мы готовы рассмотреть особые условия для оптовых покупателей, с готовностью идем на встречу к любому предложению. Особые условия подготовленны для розничных магазинов. компаний HoReCa, спорт-клубов. Если вы заинтересованы в нашей продукции, пишите или звоните в наш главный офис, мы всегда пойдем вам на встречу.',
            },
            confectionery: {
              title: 'Кондитерские и пекарни',
              text: 'СОК "Орех Причерноморья" предлагает своим клиентам выгодные условия сорудничества. Мы готовы рассмотреть особые условия для оптовых покупателей, с готовностью идем на встречу к любому предложению. Особые условия подготовленны для розничных магазинов. компаний HoReCa, спорт-клубов. Если вы заинтересованы в нашей продукции, пишите или звоните в наш главный офис, мы всегда пойдем вам на встречу.',
            },
          },
          news: {
            title: 'Новости и статьи',
            text: 'Свежие новости и полезная информация',
            showAll: 'Посмотреть ещё',
            hiddeAll: 'Скрыть',
            read: 'Читать',
            latest: 'Последние публикации',
            sm: {
              title: 'ОРЕХ ПРИЧЕРНОМОРЬЯ',
              text: 'Присоединяйтесь к нам в соц. сетях',
            },
          },
          latestNews: {
            title: 'Новости',
            showAll: 'Смотреть все новости',
          },
          gallery: {
            title: 'Галерея',
            text: 'Кадры социальной активности компании',
          },
          register: {
            title: 'Регистрация',
            contactDetails: 'Контактные данные',
            type: {
              person: 'Физическое лицо',
              company: 'Юридическое лицо',
            },
            name: 'ФИО*',
            phone: 'Телефон*',
            address: 'Адрес',
            country: 'Страна*',
            region: 'Область*',
            city: 'Город*',
            password: 'Пароль',
            repeatPassword: 'Повторите пароль*',
            agree: {
              text: 'Я согласен с',
              conditions: 'условиями регистрации',
            },
            submit: 'Продолжить',
            photo: 'Загрузить фото',
            requisite: 'Реквизиты',
            companyAddress: 'Юридический адрес',
            success: 'Вы успешно зарегистрировались.',
          },
          login: {
            position: 'Вход',
            title: 'Войти в личный кабинет',
            forgot: 'Забыли пароль?',
            submit: 'Войти',
            register: 'Регистрация',
            required: 'Все поля должны быть заполнены.',
            success: 'Вы успешно вошли в аккаунт.',
            wrongEmail: 'Почта не зарегистрирована.',
            wrongPassword: 'Неправильный пароль.',
          },
          forgotPassword: {
            title: 'Восстановление пароля',
            text: 'Введите Email Вашего аккаунта. Вам будет выслана ссылка для восстановления пароля.',
            submit: 'Отправить ссылку',
            success: 'Проверьте ваш email.',
          },
          cabinet: {
            position: 'Кабинет',
            title: 'Учетная запись',
            manager: 'Ваш Личный менеджер Олег',
            orders: 'Мои заказы',
            historyOrders: 'История заказов',
            historyTransactions: 'История транзакций',
            account: 'Моя учетная запись',
            contacts: 'Контактная информация',
            password: 'Пароль',
            address: 'Адрес',
          },
          historyOrders: {
            id: '№ Заказа',
            amount: 'Кол-во товаров',
            price: 'Стоимость',
            functions: 'Функции',
            info: 'Информация о заказе',
          },
          historyTransactions: {
            date: 'Добавлено',
            price: 'Сумма',
            success: 'Платеж принят',
          },
          changePassword: {
            current: 'Текущий пароль*',
            new: 'Новый пароль*',
            confirm: 'Подтвердите пароль*',
            submit: 'Продолжить',
            error: 'Вы ввели неверный текущий пароль.',
            success: 'Вы изменили пароль.',
          },
          order: {
            title: 'Оформление заказа',
            amount: 'Кол-во',
            price: 'Цена за товар',
            sum: 'Итоговая стоимость',
            back: 'Вернуться к покупкам',
            total: 'Всего',
            delivery: {
              title: 'Способ доставки',
              post: 'Новая почта (по Украине оплата за счет клиента)',
              warehouse: 'Отделение*',
              courier: 'Курьер по Одессе',
              self: 'Самовывоз со склада',
            },
            payment: 'Способ оплаты',
            auth: 'Для оформления заказа необходимо',
            login: 'Авторизоваться',
            or: 'или',
            register: 'Зарегистрироваться',
          },
          thanks: {
            title: 'Благодарим Вас за заказ!',
            text: 'Наши менеджеры свяжутся с Вами в ближайшее время',
          },
          footer: {
            contacts: {
              title: 'Контакты',
              office: 'Офис и отдел продаж',
              factory: 'Производство',
            },
            by: 'Разработано',
            copyright: 'Все права защищены',
          },
        },
        ua: {
          header: {
            sale: 'Ваша персональна знижка',
            admin: 'Адмiн',
            login: 'Увiйти',
            register: 'Регiстрацiя',
            logout: 'Вийти',
            callback: 'Замовити дзвiнок',
            callbackTime: 'Чекаємо Вашого дзвінка щодня з 9 до 18',
            callbackOrder: 'Введіть ваш номер телефону',
            callbackConfirm: 'Підтвердити',
            basket: {
              empty: 'Нiчого не добавлено',
              catalog: 'Перейти в каталог',
              basket: 'Перейти в корзину',
              total: 'Всього',
            },
            menu: {
              shop: 'Магазин',
              about: 'Про виробництво',
              delivery: 'Оплата і доставка',
              corporate: 'Оптовим і корпоративним клієнтам',
              news: 'Новини і статті',
              gallery: 'Галерея',
            },
          },
          home: {
            position: 'Головна',
            products: {
              title: 'Продукцiя',
              text: "Екологічно чисті, якісні ядра волоського горіха і фундука, а також плоди шипшини в зручній, надійній, вакуумній упаковці різного об'єму",
              btn: 'Перейти в магазин',
            },
            benefits: {
              title: 'Про користь продукту',
              text: 'Кожен вид горіха містить свій неповторний унікальний баланс вітамінів, і мікроелементів',
              walnut: {
                title: 'Волоський горіх',
                text: 'Дерево життя - так часто величають волоський горіх, оскільки з давніх пір він годував, відновлював сили і лікував людину. Навіть невелика жменя волоських горіхів - це криниця вітамінів і хороша профілактика багатьох захворювань.',
              },
              hazelnut: {
                title: 'Фундук',
                text: 'Вітамін А покращує зір і підвищує імунітет. Комплекс вітамінів групи В нормалізує роботу ЦНС, покращує склад крові, зміцнює імунну і кровоносну системи, систему обміну речовин.',
              },
              rose: {
                title: 'Шипшина',
                text: 'У народній медицині відвари з шипшини застосовувалися при скарлатині, тифі, туберкульозі, запаленні нирок, хворобах кишечника, печінки, шлунку.',
              },
            },
          },
          shop: {
            title: 'Каталог продукції',
            filter: {
              title: 'Фільтр',
              type: 'Тип',
              weight: 'Маса',
              price: 'Вартiсть',
              submit: 'Застосувати',
              reset: 'Скинути',
            },
            showAll: 'Подивитися ще',
            hideAll: 'Приховати',
            about: {
              title: 'Екологічно чистий волоський горіх',
              subtitle: 'Оптом і уроздріб',
              text: `Сільськогосподарський обслуговуючий кооператив "Горіх Причорномор'я" вирощує змішані сади горіха волоського з фундуком, а також горіха волоського з шипшиною, на площі більше 150 гектарів. Окрім цього кооператив займається вирощуванням посадочного матеріалу, саженцов прищепленого і неприщепленого волоського горіха, фундука і шипшини. Горіх Причорномор'я - це перший і єдиний в Україні сад по спільному вирощуванню фундука і волоського горіха Сільськогосподарський обслуговуючий кооператив "Горіх Причорномор'я" вирощує змішані сади горіха волоського з фундуком, а також горіха волоського з шипшиною, на площі більше 150 гектарів. Окрім цього кооператив займається вирощуванням посадочного матеріалу, саженцов прищепленого і неприщепленого волоського горіха, фундука і шипшини. Горіх Причорномор'я - це перший і єдиний в Україні сад по спільному вирощуванню фундука і волоського горіха`,
            },
          },
          shopItem: {
            composition: 'Склад:',
            weight: 'Маса нетто:',
            calories: 'Енергетична цінність:',
            experation: 'Термін придатності:',
            price: 'Ваша ціна:',
            order: 'Замовити',
            about: {
              description: {
                title: 'Опис',
                walnut: {
                  text: `Вже 4000 років люди живляться цінними волоськими горіхами. Вони особливо корисні післяопераційним хворим, дітям, годуючим, вагітним жінкам. Щоб повернути сили, зміцнити імунітет, здолати туберкульоз, кашель; волоський горіх очищений, відбірний треба стовкти, змішати з медом(2: 1) і чайну ложку цілющої суміші вживати перед їдою. У білці волоських горіхів багато(15 %) аргініну. Він особливо потрібний дітям, хворим, літнім людям, в організмі яких амінокислота погано синтезується. Аргінін допомагає посудинам регенерувати, а усьому організму - перемогти запалення.`,
                  list1: {
                    title: 'Інші корисні речовини волоських горіхів:',
                    item1: 'Антиоксиданти захищають печінку від ушкоджень',
                    item2: 'Поліфеноли не дають утворитися судинним тромбам',
                    item3:
                      'Нейропротектори покращують роботу мозку, відсовують старість',
                  },
                  list2: {
                    title: 'Треба систематично є волоські горіхи, щоб:',
                    item1:
                      'На 30-40 % понизити ризик захворювання раком простати',
                    item2: 'На 50 % - раком молочної залози',
                    item3:
                      'Запобігти дегенерації очної макули, тобто поліпшити зір',
                    item4:
                      'Відрегулювати обмін речовин, вироблення інсуліну; знизити кількість цукру в крові',
                  },
                },
                hazelnut: {
                  text: 'Фундук дуже корисний',
                },
                rose: {
                  text: 'Шиповник дуже корисний',
                },
              },
              package: {
                title: 'Упаковка',
                text: 'Добре упакуємо',
              },
              payment: {
                title: 'Оплата',
                text: 'Оплачуйте будь-яким зручним способом',
              },
              delivery: {
                title: 'Доставка',
                text: 'Швидко доставимо',
              },
            },
          },
          product: {
            weight: 'Маса',
            package: 'Вакуумна',
            price: 'Цiна:',
            buy: 'Придбати',
          },
          about: {
            position: 'Про виробництво',
            title: 'Про виробника',
            text: `Сільськогосподарський обслуговуючий кооператив "Горіх Причорномор'я" вирощує змішані сади горіха волоського з фундуком, а також горіха волоського з шипшиною, на площі більше 150 гектарів. Окрім цього кооператив займається вирощуванням посадочного матеріалу, саженцов прищепленого і неприщепленого волоського горіха, фундука і шипшини.`,
            description: 'Детальніше',
            writeUs: {
              title: 'Введіть ваше повідомлення',
              name: `Ваше ім'я*`,
              email: 'Ваш email*',
              message: 'Ваше повідомлення*',
              submit: 'Підтвердити',
            },
            chief: {
              name: 'Павел Тулба',
              pos: `Учередитель і власник підприємства "Горіх Причорномор'я"`,
              quote:
                'Головна наша мета - отримати максимальний прибуток з одного гектара',
              writeUs: 'Написати нам',
            },
            history: {
              title: 'Історія підприємства',
              text1:
                'Наше підприємство засноване в 2012 році для закладки змішаного саду волоського горіха і фундука.',
              text2:
                'На сьогодні ми вже заклали більше 100 гектарів саду і продовжуємо розширювати свої насадження. Окрім вирощування волоського горіха і фундука, ми займаємося вирощуванням саджанців, розведенням і вирощуванням овець, а також є першою в Україні компанією, що приступила до промислового вирощування трюфелів на коренях фундука.',
              text3:
                'Земля, якою користується кооператив, є власністю членів нашого кооперативу.',
            },
            gallery: {
              title: 'Галерея',
              text: 'Кадри соціальної активності компанії',
              showAll: 'Дивитися усю галерею',
            },
          },
          area: {
            item1: 'Змішаних садів',
            item2: 'Тепличного комплексу',
            item3: 'Перша промислова плантація шипшини в Україні',
            item4: 'Приживаності саджанців',
          },
          delivery: {
            title: 'Оплата і доставка',
            payment: {
              title: 'Оплата замовлення',
              subtitle: 'Способи оплати',
              item1: {
                title: 'Безготівковий розрахунок',
                text: 'Ви можете вибрати "отримати реквізити" для подальшої оплати на карту, або в терміналах.',
              },
              item2: {
                title: 'Оплата за допомогою банківської карти',
                text: 'Сплатіть Ваше замовлення картою будь-якого банку онлайн(LiqPay/Приват24)',
              },
              item3: {
                title: 'Готівковий розрахунок',
                text: `Оплата замовлень післяплатою у відділенні Нової Пошти, або готівковими кур'єрами`,
              },
            },
            delivery: {
              title: 'Доставка партії',
              subtitle: 'Способи доставки',
              item: {
                title: 'Нова почта',
                text: 'Доставки по усій Україні',
              },
            },
            return: {
              title: 'Повернення товару',
              item: {
                text: 'Повернення товару здійснюється відповідно до Закону України "Про захист прав споживачів".',
              },
            },
          },
          corporate: {
            title: 'Оптовим і корпоративним клієнтам',
            text1: `Сільськогосподарський обслуговуючий кооператив "Горіх Причорномор'я" пропонує своїм клієнтам вигідні умови співпраці. Особливі умови підготовлені для роздрібних магазинів, компаній HoReCa, спорт - клубів.`,
            text2:
              'Ми готові розглянути особливі умови для оптових покупців, з готовністю йдемо на зустріч будь-якій пропозиції. Якщо ви зацікавлені в нашій продукції, пишіть, або дзвоните в наш головний офіс - ми завжди підемо вам на зустріч!',
            writeUs: {
              title: 'Введіть ваше повідомлення',
              name: `Ваше ім'я*`,
              email: 'Ваш email*',
              message: 'Ваше повідомлення*',
              submit: 'Підтвердити',
              btn: 'Написати нам',
            },
            supermarket: {
              title: 'Великі супермакети',
              text: `СІК "Горіх Причорномор'я" пропонує своїм клієнтам вигідні умови сорудничества. Ми готові розглянути особливі умови для оптових покупців, з готовністю йдемо на зустріч до будь-якої пропозиції. Особливі умови подготовленны для роздрібних магазинів. компаній HoReCa, спорт-клубов. Якщо ви зацікавлені в нашій продукції, пишіть або дзвоніть в наш головний офіс, ми завжди підемо вам на зустріч.`,
            },
            shop: {
              title: 'Роздрібні магазини',
              text: `СІК "Горіх Причорномор'я" пропонує своїм клієнтам вигідні умови сорудничества. Ми готові розглянути особливі умови для оптових покупців, з готовністю йдемо на зустріч до будь-якої пропозиції. Особливі умови подготовленны для роздрібних магазинів. компаній HoReCa, спорт-клубов. Якщо ви зацікавлені в нашій продукції, пишіть або дзвоніть в наш головний офіс, ми завжди підемо вам на зустріч.`,
            },
            HoReCa: {
              title: 'Компанії HoReCa',
              text: `СІК "Горіх Причорномор'я" пропонує своїм клієнтам вигідні умови сорудничества. Ми готові розглянути особливі умови для оптових покупців, з готовністю йдемо на зустріч до будь-якої пропозиції. Особливі умови подготовленны для роздрібних магазинів. компаній HoReCa, спорт-клубов. Якщо ви зацікавлені в нашій продукції, пишіть або дзвоніть в наш головний офіс, ми завжди підемо вам на зустріч.`,
            },
            fitness: {
              title: 'Фiтнес клуби',
              text: `СІК "Горіх Причорномор'я" пропонує своїм клієнтам вигідні умови сорудничества. Ми готові розглянути особливі умови для оптових покупців, з готовністю йдемо на зустріч до будь-якої пропозиції. Особливі умови подготовленны для роздрібних магазинів. компаній HoReCa, спорт-клубов. Якщо ви зацікавлені в нашій продукції, пишіть або дзвоніть в наш головний офіс, ми завжди підемо вам на зустріч.`,
            },
            confectionery: {
              title: 'Кондитерські і пекарні',
              text: `СІК "Горіх Причорномор'я" пропонує своїм клієнтам вигідні умови сорудничества. Ми готові розглянути особливі умови для оптових покупців, з готовністю йдемо на зустріч до будь-якої пропозиції. Особливі умови подготовленны для роздрібних магазинів. компаній HoReCa, спорт-клубов. Якщо ви зацікавлені в нашій продукції, пишіть або дзвоніть в наш головний офіс, ми завжди підемо вам на зустріч.`,
            },
          },
          news: {
            title: 'Новини і статті',
            text: 'Свіжі новини і корисна інформація',
            showAll: 'Подивитися ще',
            hiddeAll: 'Приховати',
            read: 'Читати',
            latest: 'Останні публікації',
            sm: {
              title: `ГОРІХ ПРИЧОРНОМОР'Я`,
              text: 'Приєднуйтеся до нас в соц. мережах',
            },
          },
          latestNews: {
            title: 'Новини',
            showAll: 'Дивитися усі новини',
          },
          gallery: {
            title: 'Галерея',
            text: 'Кадри соціальної активності компанії',
          },
          register: {
            title: 'Реєстрація',
            contactDetails: 'Контактні дані',
            type: {
              person: 'Фізична особа',
              company: 'Юридична особа',
            },
            name: 'ПІБ*',
            phone: 'Телефон*',
            address: 'Адреса',
            country: 'Країна*',
            region: 'Область*',
            city: 'Місто*',
            password: 'Пароль',
            repeatPassword: 'Повторіть пароль*',
            agree: {
              text: 'Я згоден з',
              conditions: 'умовами реєстрації',
            },
            submit: 'Продовжити',
            photo: 'Загрузити фото',
            requisite: 'Реквізити',
            companyAddress: 'Юридична адреса',
            success: 'Ви успішно зареєструвалися.',
          },
          login: {
            position: 'Вхід',
            title: 'Увійти до особистого кабінету',
            forgot: 'Забули пароль?',
            submit: 'Увійти',
            register: 'Реєстрація',
            required: 'Все поля должны быть заполнены.',
            success: 'Усі поля мають бути заповнені.',
            wrongEmail: 'Пошта не зареєстрована.',
            wrongPassword: 'Неправильний пароль.',
          },
          forgotPassword: {
            title: 'Відновлення пароля',
            text: 'Введіть Email Вашого аккаунта. Вам буде вислано посилання для відновлення пароля.',
            submit: 'Відправити посилання',
            success: 'Перевірте ваш email.',
          },
          cabinet: {
            position: 'Кабінет',
            title: 'Обліковий запис',
            manager: 'Ваш Особистий менеджер Олег',
            orders: 'Мої замовлення',
            historyOrders: 'Історія замовлень',
            historyTransactions: 'Історія транзакцій',
            account: 'Мій обліковий запис',
            contacts: 'Контактна інформація',
            password: 'Пароль',
            address: 'Адреса',
          },
          historyOrders: {
            id: '№ Замовлення',
            amount: 'К-ть товарів',
            price: 'Вартість',
            functions: 'Функції',
            info: 'Інформація про замовлення',
          },
          historyTransactions: {
            date: 'Додано',
            price: 'Сума',
            success: 'Платіж прийнятий',
          },
          changePassword: {
            current: 'Поточний пароль',
            new: 'Новий пароль',
            confirm: 'Підтвердіть пароль',
            submit: 'Продовжити',
            error: 'Ви ввели невірний поточний пароль.',
            success: 'Ви змінили пароль.',
          },
          order: {
            title: 'Оформлення замовлення',
            amount: 'К-ть',
            price: 'Цiна за товар',
            sum: 'Підсумкова вартість',
            back: 'Повернутися до покупок',
            total: 'Всього',
            delivery: {
              title: 'Спосіб доставки',
              post: 'Нова пошта(по Україні оплата за рахунок клієнта)',
              warehouse: 'Відділення*',
              courier: `Кур'єр по Одесі`,
              self: 'Самовивезення із складу',
            },
            payment: 'Спосіб оплати',
            auth: 'Для оформлення замовлення необхідно',
            login: 'Авторизуватися',
            or: 'або',
            register: 'Зареєструватися',
          },
          thanks: {
            title: 'Дякуємо Вам за замовлення!',
            text: `Наші менеджери зв'яжуться з Вами найближчим часом`,
          },
          footer: {
            contacts: {
              title: 'Контакти',
              office: 'Офіс і відділ продажів',
              factory: 'Виробництво',
            },
            by: 'Розроблено',
            copyright: 'Усі права захищені',
          },
        },
      },
    },
  },

  // Build Configuration: https://go.nuxtjs.dev/config-build
  build: {
    transiple: ['vee-validate'],
  },
}
